; domain
(define (domain call_of_duty)
  (:requirements :strips :typing)
  (:types
    game_character
    routes
    bomb
    pistol
    place
    state
    task
  )

  (:predicates
    ;;
    (location ?c - game_character ?p - place)

    ;;
    (focus ?c - game_character ?t - task)

    ;;
    (coverage ?r - routes ?s - state)

    ;;
    (appearance ?r - routes ?s - state)

    ;;
    (knowledge ?r - routes ?s - state)

    ;;
    (skill ?b - bomb ?s - state)

    ;;
    (pistol_location ?p - pistol ?s - state)

    ;;
    (availability ?p - pistol ?s - state)
  )

  ;;   1:
  (:action move_in
    :parameters (?c - game_character ?r - routes ?from - place ?to - place)
    :precondition (and
                    (location ?c ?from)
                    (coverage ?r uncovered)
                    (appearance ?r uncovered))
    :effect (and
             (location ?c ?to)
             (coverage ?r covered)
             (appearance ?r covered))
  )

  ;;   2:
  (:action find_hiding_spot
    :parameters (?c - game_character ?p - pistol ?ps - place)
    :precondition (and
                    (location ?c ?ps)
                    (pistol_location ?p concealed)
                    (availability ?p in_inventory))
    :effect (and
             (location ?c hidden)
             (pistol_location ?p exposed)
             (availability ?p equipped))
  )

  ;;   3:
  (:action investigate_routes
    :parameters (?c - game_character ?r - routes)
    :precondition (and
                    (location ?c hidden)
                    (focus ?c pulling_out_pistol)
                    (knowledge ?r uninvestigated))
    :effect (and
             (focus ?c investigating)
             (knowledge ?r investigated))
  )

  ;;   4:
  (:action wait_until_planting
    :parameters (?c - game_character ?b - bomb)
    :precondition (and
                    (focus ?c investigating)
                    (skill ?b unplanted))
    :effect (and
             (focus ?c waiting)
             (skill ?b planted))
  )

  ;;   5:
  (:action start_defusing
    :parameters (?c - game_character ?b - bomb)
    :precondition (and
                    (location ?c hidden)
                    (focus ?c waiting)
                    (skill ?b planted))
    :effect (and
             (location ?c now_at_bomb)
             (focus ?c defusing)
             (skill ?b defused))
  )
)

; problem
(define (problem ninja_defuse)
  (:domain call_of_duty)

  (:objects
    character - game_character
    current_routes - routes
    game_bomb - bomb
    player_pistol - pistol
    further_out in hidden now_at_bomb - place
    uncovered covered uninvestigated investigated - state
    pulling_out_pistol investigating waiting defusing - task
    in_inventory equipped concealed exposed - state
    planted defused - state
  )

  (:init
    ;;
    (location character further_out)

    ;;
    (focus character pulling_out_pistol)

    ;;
    (coverage current_routes uncovered)
    (appearance current_routes uncovered)
    (knowledge current_routes uninvestigated)

    ;;
    (skill game_bomb unplanted)

    ;;
    (pistol_location player_pistol concealed)
    (availability player_pistol in_inventory)
  )

  (:goal
    (and
      ;;
      (location character now_at_bomb)
      (focus character defusing)

      ;;
      (skill game_bomb defused)
    )
  )
)

; plan
1. (find_hiding_spot character player_pistol further_out)
   added: (location character hidden) (pistol_location player_pistol exposed) (availability player_pistol equipped)
   goals met: 0 of 3
2. (investigate_routes character current_routes)
   added: (focus character investigating) (knowledge current_routes investigated)
   goals met: 0 of 3
3. (wait_until_planting character game_bomb)
   added: (focus character waiting) (skill game_bomb planted)
   goals met: 0 of 3
4. (start_defusing character game_bomb)
   added: (location character now_at_bomb) (focus character defusing) (skill game_bomb defused)
   goals met: 3 of 3
